Repository: Levitanus/KlavierApp
Catalog: frontend/lib/l10n/app_*.arb
Languages: de

# languageTitle
source: Language
de: Sprache

# languageGerman
source: German
de: Deutsch

# languageEnglish
source: English
de: Englisch

# languageRussian
source: Russian
de: Russisch

# securityTitle
source: Security
de: Sicherheit

# changePasswordTitle
source: Change Password
de: Passwort aendern

# changePasswordSubtitle
source: Update your account password
de: Konto-Passwort aktualisieren

# consentTitle
source: Consent to Personal Data Processing
de: Einwilligung zur Verarbeitung personenbezogener Daten

# consentAgree
source: Agree
de: Zustimmen

# consentGuardianConfirm
source: If you register a child, you confirm that you are a parent, legal guardian, or otherwise authorized person.
de: Wenn Sie ein Kind registrieren, bestaetigen Sie, dass Sie Elternteil, gesetzlicher Vertreter oder anderweitig berechtigt sind.

# consentRequired
source: Please accept the consent to continue
de: Bitte stimmen Sie der Einwilligung zu, um fortzufahren

# consentFallback
source: Consent (short) - Music learning content only. - You can edit or delete your profile. - Data is protected with TLS. - No sharing except email delivery (SendGrid). If registering a child, you confirm you are a parent/guardian or authorized.
de: Einwilligung (kurz) - Nur Inhalte zum Musiklernen. - Sie koennen Ihr Profil bearbeiten oder loeschen. - Daten sind mit TLS geschuetzt. - Keine Weitergabe ausser fuer E-Mail-Zustellung (SendGrid). Wenn Sie ein Kind registrieren, bestaetigen Sie, dass Sie Elternteil/Erziehungsberechtigter oder autorisiert sind.

# commonSettings
source: Settings
de: Einstellungen

# commonOpen
source: Open
de: Oeffnen

# commonPost
source: Post
de: Posten

# commonEdit
source: Edit
de: Bearbeiten

# commonReply
source: Reply
de: Antworten

# commonDelete
source: Delete
de: Loeschen

# commonAdd
source: Add
de: Hinzufuegen

# commonSave
source: Save
de: Speichern

# commonCancel
source: Cancel
de: Abbrechen

# commonRefresh
source: Refresh
de: Aktualisieren

# commonClose
source: Close
de: Schliessen

# commonDownload
source: Download
de: Herunterladen

# commonDownloadSourceFile
source: Download source file
de: Quelldatei herunterladen

# commonDownloadStarted
source: Download started
de: Download gestartet

# commonDownloadFailed
source: Download failed
de: Download fehlgeschlagen

# commonSavedToPath
source: Saved to {path}
de: Gespeichert unter {path}

# commonBack5s
source: Back 5s
de: 5s zurueck

# commonForward5s
source: Forward 5s
de: 5s vor

# commonBold
source: Bold
de: Fett

# commonItalic
source: Italic
de: Kursiv

# commonUnderline
source: Underline
de: Unterstrichen

# commonStrike
source: Strike
de: Durchgestrichen

# commonSubscript
source: Sub
de: Tiefgestellt

# commonSuperscript
source: Super
de: Hochgestellt

# commonTitle
source: Title
de: Titel

# commonSend
source: Send
de: Senden

# commonApply
source: Apply
de: Anwenden

# commonInsertLink
source: Insert link
de: Link einfuegen

# commonAttachFile
source: Attach file
de: Datei anhaengen

# commonImage
source: Image
de: Bild

# commonFile
source: File
de: Datei

# commonVoiceMessage
source: Voice message
de: Sprachnachricht

# commonTapToPlay
source: Tap to play
de: Zum Abspielen tippen

# commonLoading
source: Loading
de: Laedt

# commonFullscreen
source: Fullscreen
de: Vollbild

# commonExitFullscreen
source: Exit fullscreen
de: Vollbild beenden

# commonPrevious
source: Previous page
de: Vorherige Seite

# commonNext
source: Next page
de: Naechste Seite

# commonClearSearch
source: Clear search
de: Suche leeren

# commonNoResults
source: No results found
de: Keine Ergebnisse gefunden

# commonTypeToFilter
source: Type to filter...
de: Zum Filtern tippen...

# commonRequired
source: Required
de: Erforderlich

# commonErrorMessage
source: Error: {error}
de: Fehler: {error}

# commonCreated
source: created
de: erstellt

# commonUpdated
source: updated
de: aktualisiert

# commonCreate
source: create
de: erstellen

# commonUpdate
source: update
de: aktualisieren

# feedsNone
source: No feeds available
de: Keine Feeds verfuegbar

# feedsSchool
source: School
de: Schule

# feedsTeacherFeeds
source: Teacher feeds
de: Lehrer-Feeds

# feedsOwnerSchool
source: School
de: Schule

# feedsOwnerTeacher
source: Teacher
de: Lehrer

# feedsNewPostTooltip
source: New post
de: Neuer Beitrag

# feedsMarkAllRead
source: Mark all as read
de: Alle als gelesen markieren

# feedsImportant
source: Important
de: Wichtig

# feedsLatest
source: Latest
de: Neueste

# feedsNoImportantPosts
source: No important posts yet.
de: Noch keine wichtigen Beitraege.

# feedsAllPosts
source: All posts
de: Alle Beitraege

# feedsNoPosts
source: No posts yet.
de: Noch keine Beitraege.

# feedsNoTextPreview
source: No text preview available.
de: Keine Textvorschau verfuegbar.

# feedsReadAndDiscuss
source: Read and discuss
de: Lesen und diskutieren

# feedsPostedAt
source: Posted {timestamp}
de: Gepostet {timestamp}

# feedsPostedEditedAt
source: Posted {timestamp} Â· edited
de: Gepostet {timestamp} Â· bearbeitet

# feedsSubscriptionFailed
source: Failed to update subscription
de: Abo konnte nicht aktualisiert werden

# feedsDeleteDenied
source: You do not have permission to delete this post
de: Sie haben keine Berechtigung, diesen Beitrag zu loeschen

# feedsDeleteTitle
source: Delete Post
de: Beitrag loeschen

# feedsDeleteMessage
source: Are you sure you want to delete this post? This action cannot be undone.
de: Sind Sie sicher, dass Sie diesen Beitrag loeschen moechten? Diese Aktion kann nicht rueckgaengig gemacht werden.

# feedsDeleteFailed
source: Failed to delete post
de: Beitrag konnte nicht geloescht werden

# feedsDeleteCommentTitle
source: Delete Comment
de: Kommentar loeschen

# feedsDeleteCommentMessage
source: Are you sure you want to delete this comment? This action cannot be undone.
de: Sind Sie sicher, dass Sie diesen Kommentar loeschen moechten? Diese Aktion kann nicht rueckgaengig gemacht werden.

# feedsDeleteCommentFailed
source: Failed to delete comment
de: Kommentar konnte nicht geloescht werden

# feedsUnsupportedAttachment
source: Unsupported attachment: {type}
de: Nicht unterstuetzter Anhang: {type}

# feedsAttachmentActions
source: Attachment actions
de: Anhangaktionen

# feedsCommentActions
source: Comment actions
de: Kommentaraktionen

# feedsEditPost
source: Edit post
de: Beitrag bearbeiten

# feedsNewPost
source: New post
de: Neuer Beitrag

# feedsTextTools
source: Text tools
de: Textwerkzeuge

# feedsTextFormatting
source: Text formatting
de: Textformatierung

# feedsJustificationTools
source: Justification tools
de: Ausrichtungswerkzeuge

# feedsListsPaddingTools
source: Lists and padding tools
de: Listen- und Einrueckungswerkzeuge

# feedsAttachments
source: Attachments
de: Anhaenge

# feedsAllowComments
source: Allow comments
de: Kommentare erlauben

# feedsMarkImportant
source: Mark as important
de: Als wichtig markieren

# feedsUploadFailed
source: Failed to upload media
de: Medien konnten nicht hochgeladen werden

# feedsEditComment
source: Edit comment
de: Kommentar bearbeiten

# feedsNewComment
source: New comment
de: Neuer Kommentar

# feedsComments
source: Comments
de: Kommentare

# feedsNoComments
source: No comments yet.
de: Noch keine Kommentare.

# feedsAddComment
source: Add Comment
de: Kommentar hinzufuegen

# feedsSubscribeComments
source: Subscribe to comments
de: Kommentare abonnieren

# feedsUnsubscribeComments
source: Unsubscribe from comments
de: Kommentar-Abo beenden

# feedsSettingsTitle
source: Feed settings
de: Feed-Einstellungen

# feedsAllowStudentPosts
source: Allow student posts
de: Beitraege von Schuelern erlauben

# feedsAutoSubscribe
source: Auto-subscribe to new posts
de: Neue Beitraege automatisch abonnieren

# feedsNotifyNewPosts
source: Notify on new posts
de: Bei neuen Beitraegen benachrichtigen

# feedsParagraphType
source: Paragraph type
de: Absatztyp

# feedsFont
source: Font
de: Schriftart

# feedsSize
source: Size
de: Groesse

# feedsAttach
source: Attach
de: Anhaengen

# feedsPostTitle
source: Post
de: Beitrag

# feedsUnsupportedEmbed
source: Unsupported embed: {data}
de: Nicht unterstuetztes Embed: {data}

# feedsUntitledPost
source: Untitled post
de: Unbenannter Beitrag

# videoWebLimited
source: Web video player is limited. You can download the file or open it separately.
de: Der Web-Video-Player ist eingeschraenkt. Sie koennen die Datei herunterladen oder separat oeffnen.

# videoErrorTitle
source: Video Error
de: Video-Fehler

# videoLoadFailed
source: Failed to load video
de: Video konnte nicht geladen werden

# voiceRecordFailed
source: Failed to record audio
de: Audioaufnahme fehlgeschlagen

# voiceRecordUnavailable
source: Voice recording not available
de: Audioaufnahme nicht verfuegbar

# voiceRecordError
source: Voice error: {error}
de: Sprachfehler: {error}

# voiceStopRecording
source: Stop recording
de: Aufnahme stoppen

# voiceRecord
source: Record voice
de: Sprache aufnehmen

# hometasksChecklistUpdateFailed
source: Failed to update checklist item.
de: Checklistenpunkt konnte nicht aktualisiert werden.

# hometasksItemsSaved
source: Items saved successfully.
de: Elemente erfolgreich gespeichert.

# hometasksItemsSaveFailed
source: Failed to save items.
de: Elemente konnten nicht gespeichert werden.

# hometasksProgressUpdateFailed
source: Failed to update progress item.
de: Fortschritt konnte nicht aktualisiert werden.

# hometasksUpdateFailed
source: Failed to update hometask.
de: Hausaufgabe konnte nicht aktualisiert werden.

# hometasksTeacherFallback
source: Teacher #{teacherId}
de: Lehrer #{teacherId}

# hometasksItemNameRequired
source: All items must have a name.
de: Alle Elemente muessen einen Namen haben.

# hometasksDueLabel
source: Due: {date}
de: Faellig: {date}

# hometasksEditItems
source: Edit items
de: Elemente bearbeiten

# hometasksMarkCompleted
source: Mark completed
de: Als erledigt markieren

# hometasksMarkAccomplished
source: Mark accomplished
de: Als abgeschlossen markieren

# hometasksReturnActive
source: Return to active
de: Zurueck zu aktiv

# hometasksMarkUncompleted
source: Mark uncompleted
de: Als nicht erledigt markieren

# hometasksProgressNotStarted
source: Not started
de: Nicht begonnen

# hometasksProgressInProgress
source: In progress
de: In Bearbeitung

# hometasksProgressNearlyDone
source: Nearly done
de: Fast fertig

# hometasksProgressAlmostComplete
source: Almost complete
de: Beinahe abgeschlossen

# hometasksProgressComplete
source: Complete
de: Abgeschlossen

# hometasksItemHint
source: Item {index}
de: Element {index}

# hometasksAddItem
source: Add item
de: Element hinzufuegen

# notificationsTitle
source: Notifications
de: Benachrichtigungen

# notificationsUnread
source: Unread
de: Ungelesen

# notificationsNone
source: No notifications
de: Keine Benachrichtigungen

# chatNoTeachers
source: No teachers found
de: Keine Lehrer gefunden

# chatSelectTeacher
source: Select Teacher
de: Lehrer waehlen

# chatStartFailed
source: Failed to start chat
de: Chat konnte nicht gestartet werden

# chatAdminOpenFailed
source: Failed to open admin chat
de: Admin-Chat konnte nicht geoeffnet werden

# chatDeleteMessageTitle
source: Delete message
de: Nachricht loeschen

# chatDeleteMessageBody
source: Are you sure you want to delete this message? This action cannot be undone.
de: Sind Sie sicher, dass Sie diese Nachricht loeschen moechten? Diese Aktion kann nicht rueckgaengig gemacht werden.

# chatDeleteMessageFailed
source: Failed to delete message
de: Nachricht konnte nicht geloescht werden

# chatEditMessage
source: Edit message
de: Nachricht bearbeiten

# chatMessageActions
source: Message actions
de: Nachrichtenaktionen

# chatMessages
source: Messages
de: Nachrichten

# chatNoConversations
source: No conversations yet
de: Noch keine Unterhaltungen

# chatStartConversation
source: Start a conversation
de: Unterhaltung starten

# chatUnknownUser
source: Unknown
de: Unbekannt

# chatNoMessages
source: (No messages)
de: (Keine Nachrichten)

# chatTeachers
source: Teachers
de: Lehrer

# chatNewChat
source: New Chat
de: Neuer Chat

# chatThreadNotFound
source: Chat created, but thread not found
de: Chat erstellt, aber Thread nicht gefunden

# chatStartNew
source: Start New Chat
de: Neuen Chat starten

# chatSearchUsers
source: Search users...
de: Benutzer suchen...

# profileAdminControls
source: Admin Controls
de: Admin-Steuerung

# profileAdminAccess
source: Admin Access
de: Admin-Zugriff

# profileAdminAccessSubtitle
source: Grant or revoke admin permissions
de: Admin-Berechtigungen erteilen oder entziehen

# profileAdminAccessUpdate
source: Update Admin Access
de: Admin-Zugriff aktualisieren

# profileRoleManagement
source: Role Management
de: Rollenverwaltung

# profileMakeStudent
source: Make Student
de: Zum Schueler machen

# profileMakeParent
source: Make Parent
de: Zum Elternteil machen

# profileMakeTeacher
source: Make Teacher
de: Zum Lehrer machen

# profileArchiveRoles
source: Archive Roles
de: Rollen archivieren

# profileSectionInfo
source: Profile Information
de: Profilinformationen

# profileSectionAdditional
source: Additional Information
de: Zusaetzliche Informationen

# profileTitleProfile
source: Profile
de: Profil

# profileTitleUserProfile
source: User Profile
de: Benutzerprofil

# profileEditTooltip
source: Edit Profile
de: Profil bearbeiten

# profileAdminViewLabel
source: Admin View
de: Admin-Ansicht

# profilePhoneLabel
source: Phone
de: Telefon

# profileMemberSinceLabel
source: Member Since
de: Mitglied seit

# profileNotSet
source: Not set
de: Nicht gesetzt

# profileUnknown
source: Unknown
de: Unbekannt

# profileRolesTitle
source: Roles
de: Rollen

# profileBirthdayLabel
source: Birthday
de: Geburtstag

# profileBirthdayInputLabel
source: Birthday (YYYY-MM-DD)
de: Geburtstag (JJJJ-MM-TT)

# profileGenerateParentLink
source: Generate Parent Registration Link
de: Eltern-Registrierungslink erstellen

# profileMyChildrenTitle
source: My Children
de: Meine Kinder

# profileChildrenSubtitle
source: Tap on a child to view or edit their information
de: Tippen Sie auf ein Kind, um die Informationen anzuzeigen oder zu bearbeiten

# profileActionMessage
source: Message
de: Nachricht

# profileManageStudentsTitle
source: Manage Students
de: Schueler verwalten

# profileActionAddStudent
source: Add Student
de: Schueler hinzufuegen

# profileManageStudentsSubtitle
source: Manage students assigned to you
de: Schueler verwalten, die Ihnen zugeordnet sind

# profileNoStudentsAssigned
source: No students assigned yet
de: Noch keine Schueler zugeordnet

# profileActionViewProfile
source: View Profile
de: Profil ansehen

# profileActionAssignHometask
source: Assign Hometask
de: Hausaufgabe zuweisen

# profileActionRemoveStudent
source: Remove from Students
de: Aus Schuelern entfernen

# profileGenerateStudentLink
source: Generate Student Registration Link
de: Schueler-Registrierungslink erstellen

# profileTeachersTitle
source: Teachers
de: Lehrer

# profileTeachersSubtitle
source: Tap to view teacher profile or leave teacher
de: Tippen, um das Lehrerprofil anzusehen oder den Lehrer zu verlassen

# profileNoTeachersAssigned
source: No teachers assigned yet
de: Noch keine Lehrer zugeordnet

# profileActionLeaveTeacher
source: Leave Teacher
de: Lehrer verlassen

# profileArchiveStudent
source: Archive Student
de: Schueler archivieren

# profileUnarchiveStudent
source: Unarchive Student
de: Schueler wiederherstellen

# profileArchiveParent
source: Archive Parent
de: Eltern archivieren

# profileUnarchiveParent
source: Unarchive Parent
de: Eltern wiederherstellen

# profileArchiveTeacher
source: Archive Teacher
de: Lehrer archivieren

# profileUnarchiveTeacher
source: Unarchive Teacher
de: Lehrer wiederherstellen

# profileParentTools
source: Parent Tools
de: Eltern-Werkzeuge

# profileAddChildren
source: Add Children
de: Kinder hinzufuegen

# adminUserManagement
source: User Management
de: Benutzerverwaltung

# adminSearchUsers
source: Search by username or full name
de: Nach Benutzername oder vollem Namen suchen

# adminNoUsers
source: No users found
de: Keine Benutzer gefunden

# adminAddUser
source: Add User
de: Benutzer hinzufuegen

# adminUser
source: User
de: Benutzer

# adminStudent
source: Student
de: Schueler

# adminParent
source: Parent
de: Eltern

# adminTeacher
source: Teacher
de: Lehrer

# adminAddStudent
source: Add Student
de: Schueler hinzufuegen

# adminAddParent
source: Add Parent
de: Eltern hinzufuegen

# adminAddTeacher
source: Add Teacher
de: Lehrer hinzufuegen

# adminShowingRange
source: Showing {start}-{end} of {total}
de: Anzeige {start}-{end} von {total}

# adminRows
source: Rows:
de: Zeilen:

# adminViewProfile
source: View Profile
de: Profil anzeigen

# adminEditUser
source: Edit User
de: Benutzer bearbeiten

# adminDeleteUser
source: Delete User
de: Benutzer loeschen

# adminFullName
source: Full Name
de: Voller Name

# adminUsername
source: Username
de: Benutzername

# adminActions
source: Actions
de: Aktionen

# adminLoadUsersFailed
source: Failed to load users
de: Benutzer konnten nicht geladen werden

# adminUserSaved
source: User {action} successfully
de: Benutzer {action} erfolgreich

# adminUserSaveFailed
source: Failed to {action} user
de: Benutzer konnte nicht {action} werden

# adminResetLinkGenerated
source: Reset Link Generated
de: Reset-Link erstellt

# adminResetLinkFor
source: Reset link for {username}:
de: Reset-Link fuer {username}:

# adminResetLinkExpires
source: Expires: {expires}
de: Laeuft ab: {expires}

# adminCopyLink
source: Copy Link
de: Link kopieren

# adminResetLinkCopied
source: Reset link copied to clipboard
de: Reset-Link in Zwischenablage kopiert

# adminResetLinkFailed
source: Failed to generate reset link
de: Reset-Link konnte nicht erstellt werden

# adminUserDeleted
source: User {username} deleted
de: Benutzer {username} geloescht

# adminDeleteUserFailed
source: Failed to delete user
de: Benutzer konnte nicht geloescht werden

# adminConvertedStudent
source: User converted to student
de: Benutzer zum Schueler umgewandelt

# adminConvertedParent
source: User converted to parent
de: Benutzer zum Elternteil umgewandelt

# adminConvertedTeacher
source: User converted to teacher
de: Benutzer zum Lehrer umgewandelt

# adminStudentCreated
source: Student created successfully
de: Schueler erfolgreich erstellt

# adminParentCreated
source: Parent created successfully
de: Eltern erfolgreich erstellt

# adminTeacherCreated
source: Teacher created successfully
de: Lehrer erfolgreich erstellt

# adminDeleteUserTitle
source: Delete User
de: Benutzer loeschen

# adminDeleteUserMessage
source: Delete {username}? This cannot be undone.
de: {username} loeschen? Dies kann nicht rueckgaengig gemacht werden.

# adminUsernameRequired
source: Please enter a username
de: Bitte Benutzernamen eingeben

# adminFullNameRequired
source: Please enter a full name
de: Bitte vollen Namen eingeben

# adminPassword
source: Password
de: Passwort

# adminNewPasswordOptional
source: New Password (optional)
de: Neues Passwort (optional)

# adminPasswordRequired
source: Please enter a password
de: Bitte Passwort eingeben

# adminGeneratePassword
source: Generate Password
de: Passwort generieren

# adminPhoneOptional
source: Phone (optional)
de: Telefon (optional)

# adminConvertRole
source: Convert to Role:
de: In Rolle umwandeln:

# adminCopyCredentials
source: Copy Credentials
de: Zugangsdaten kopieren

# adminCredentialsRequired
source: Fill username and password first
de: Bitte zuerst Benutzername und Passwort ausfuellen

# adminCredentialsCopied
source: Credentials copied
de: Zugangsdaten kopiert

# adminMakeStudentTitle
source: Make {username} a Student
de: {username} zum Schueler machen

# adminMakeParentTitle
source: Make {username} a Parent
de: {username} zum Elternteil machen

# adminMakeTeacherTitle
source: Make {username} a Teacher
de: {username} zum Lehrer machen

# adminMakeTeacherNote
source: This will grant teacher privileges to the user.
de: Dies gibt dem Benutzer Lehrerrechte.

# adminBirthdayLabel
source: Birthday (YYYY-MM-DD)
de: Geburtstag (JJJJ-MM-TT)

# adminBirthdayFormat
source: Format: YYYY-MM-DD
de: Format: JJJJ-MM-TT

# adminConvert
source: Convert
de: Umwandeln

# adminSelectStudentsLabel
source: Select Students (at least one):
de: Schueler auswaehlen (mindestens einen):

# adminSelectChildrenLabel
source: Select Children (at least one):
de: Kinder auswaehlen (mindestens ein):

# adminSearchStudents
source: Search students
de: Schueler suchen

# adminNoStudents
source: No students found
de: Keine Schueler gefunden

# adminSelectStudentRequired
source: At least one student required
de: Mindestens ein Schueler erforderlich

# dashboardNoStudents
source: No students available.
de: Keine Schueler verfuegbar.

# dashboardTitle
source: Dashboard
de: Uebersicht

# dashboardTeacherFeeds
source: Teacher feeds
de: Lehrer-Feeds

# dashboardNoTeacherFeeds
source: No teacher feeds yet.
de: Noch keine Lehrer-Feeds.

# dashboardSchoolFeed
source: School feed
de: Schul-Feed

# dashboardNoSchoolFeed
source: No school feed yet.
de: Noch kein Schul-Feed.

# dashboardGroupFeeds
source: Group feeds
de: Gruppen-Feeds

# dashboardNoGroupFeeds
source: No group feeds yet.
de: Noch keine Gruppen-Feeds.

# dashboardOwnerSchool
source: School
de: Schule

# dashboardOwnerTeacher
source: Teacher
de: Lehrer

# dashboardOwnerGroup
source: Group
de: Gruppe

# dashboardStudentLabel
source: Student:
de: Schueler:

# dashboardChildLabel
source: Child:
de: Kind:

# dashboardNoActiveHometasks
source: No active hometasks.
de: Keine aktiven Hausaufgaben.

# homeClearAppCacheTitle
source: Clear app data cache
de: App-Daten-Cache leeren

# homeClearAppCacheBody
source: This will remove cached messages, feeds, hometasks, and profile data.
de: Dies entfernt zwischengespeicherte Nachrichten, Feeds, Hausaufgaben und Profildaten.

# homeAppCacheCleared
source: App data cache cleared.
de: App-Daten-Cache geleert.

# homeClearMediaCacheTitle
source: Clear media cache
de: Medien-Cache leeren

# homeClearMediaCacheBody
source: This will remove cached images and media files.
de: Dies entfernt zwischengespeicherte Bilder und Mediendateien.

# homeMediaCacheCleared
source: Media cache cleared.
de: Medien-Cache geleert.

# homeLogoutTitle
source: Logout
de: Abmelden

# homeLogoutBody
source: Are you sure you want to logout?
de: Moechten Sie sich wirklich abmelden?

# homeMenuTooltip
source: Menu
de: Menue

# homeRolesLabel
source: Roles: {roles}
de: Rollen: {roles}

# homeProfileInfo
source: Your profile information
de: Ihre Profilinformationen

# commonClear
source: Clear
de: Leeren

# commonLogout
source: Logout
de: Abmelden

# commonNotifications
source: Notifications
de: Benachrichtigungen

# commonProfile
source: Profile
de: Profil

# commonUserManagement
source: User Management
de: Benutzerverwaltung

# commonTheme
source: Theme
de: Design

# commonLight
source: Light
de: Hell

# commonDark
source: Dark
de: Dunkel

# commonDashboard
source: Dashboard
de: Uebersicht

# commonHometasks
source: Hometasks
de: Hausaufgaben

# commonUsername
source: Username
de: Benutzername

# commonPassword
source: Password
de: Passwort

# commonFullName
source: Full Name
de: Voller Name

# commonPhoneOptional
source: Phone (optional)
de: Telefon (optional)

# commonConfirmPassword
source: Confirm Password
de: Passwort bestaetigen

# commonBackToLogin
source: Back to Login
de: Zurueck zur Anmeldung

# commonErrorTitle
source: Error
de: Fehler

# registerRoleStudent
source: Student
de: Schueler

# registerRoleParent
source: Parent
de: Elternteil

# registerRoleTeacher
source: Teacher
de: Lehrer

# registerInvalidTokenTitle
source: Invalid Registration Token
de: Ungueltiger Registrierungs-Token
