Repository: Levitanus/KlavierApp
Catalog: frontend/lib/l10n/app_*.arb
Languages: de

# registerInvalidTokenMessage
source: This registration link may be expired or already used.
de: Dieser Registrierungslink ist abgelaufen oder wurde bereits verwendet.

# registerGoToLogin
source: Go to Login
de: Zur Anmeldung

# registerTitle
source: Register as {role}
de: Registrieren als {role}

# registerParentOf
source: You will be registered as parent of:
de: Sie werden als Elternteil registriert fuer:

# registerComplete
source: Complete your registration
de: Registrierung abschliessen

# registerUsernameRequired
source: Please enter a username
de: Bitte Benutzernamen eingeben

# registerUsernameMin
source: Username must be at least 3 characters
de: Benutzername muss mindestens 3 Zeichen haben

# registerFullNameRequired
source: Please enter your full name
de: Bitte vollen Namen eingeben

# registerBirthdayLabel
source: Birthday (YYYY-MM-DD)
de: Geburtstag (JJJJ-MM-TT)

# registerBirthdayRequired
source: Please enter your birthday
de: Bitte Geburtstag eingeben

# registerBirthdayFormat
source: Use format: YYYY-MM-DD
de: Format: JJJJ-MM-TT

# registerPasswordRequired
source: Please enter a password
de: Bitte Passwort eingeben

# registerPasswordMin
source: Password must be at least 6 characters
de: Passwort muss mindestens 6 Zeichen haben

# registerConfirmRequired
source: Please confirm your password
de: Bitte Passwort bestaetigen

# registerPasswordsMismatch
source: Passwords do not match
de: Passwoerter stimmen nicht ueberein

# registerButton
source: Register
de: Registrieren

# registerLoginFailed
source: Login failed
de: Anmeldung fehlgeschlagen

# registerFailed
source: Registration failed
de: Registrierung fehlgeschlagen

# registerNetworkError
source: Network error: {error}
de: Netzwerkfehler: {error}

# registerValidateFailed
source: Failed to validate token
de: Token konnte nicht validiert werden

# resetErrorValidating
source: Error validating token: {error}
de: Fehler beim Validieren des Tokens: {error}

# resetSuccessTitle
source: Success
de: Erfolg

# resetSuccessMessage
source: Your password has been reset successfully. You can now log in with your new password.
de: Ihr Passwort wurde erfolgreich zurueckgesetzt. Sie koennen sich jetzt mit dem neuen Passwort anmelden.

# resetFailed
source: Failed to reset password
de: Passwort konnte nicht zurueckgesetzt werden

# resetErrorGeneric
source: Error: {error}
de: Fehler: {error}

# resetTitle
source: Reset Password
de: Passwort zuruecksetzen

# resetValidating
source: Validating reset token...
de: Reset-Token wird geprueft...

# resetInvalidTitle
source: Invalid or Expired Link
de: Ungueltiger oder abgelaufener Link

# resetInvalidMessage
source: This password reset link is invalid or has expired. Please request a new password reset link.
de: Dieser Link zum Zuruecksetzen ist ungueltig oder abgelaufen. Bitte fordern Sie einen neuen Link an.

# resetSetNewPassword
source: Set New Password
de: Neues Passwort setzen

# resetForUser
source: for user: {username}
de: fuer Benutzer: {username}

# resetNewPasswordLabel
source: New Password
de: Neues Passwort

# resetPasswordRequired
source: Please enter a password
de: Bitte Passwort eingeben

# resetPasswordMin
source: Password must be at least 6 characters
de: Passwort muss mindestens 6 Zeichen haben

# resetConfirmPasswordLabel
source: Confirm Password
de: Passwort bestaetigen

# resetConfirmRequired
source: Please confirm your password
de: Bitte Passwort bestaetigen

# loginTitle
source: Login
de: Anmelden

# loginForgotTitle
source: Forgot Password
de: Passwort vergessen

# loginForgotPrompt
source: Enter your username to request a password reset.
de: Geben Sie Ihren Benutzernamen ein, um das Zuruecksetzen anzufordern.

# loginUsernameRequired
source: Please enter your username
de: Bitte Benutzernamen eingeben

# loginPasswordRequired
source: Please enter your password
de: Bitte Passwort eingeben

# loginButton
source: Login
de: Anmelden

# loginForgotPassword
source: Forgot Password?
de: Passwort vergessen?

# loginRequestSentTitle
source: Request Sent
de: Anfrage gesendet

# loginRequestSentMessage
source: Password reset request sent successfully.
de: Anfrage zum Zuruecksetzen wurde gesendet.

# loginRequestFailedMessage
source: Failed to send password reset request. Please try again.
de: Anfrage zum Zuruecksetzen fehlgeschlagen. Bitte erneut versuchen.

# loginErrorMessage
source: An error occurred: {error}
de: Ein Fehler ist aufgetreten: {error}

source: Login failed
de: Anmeldung fehlgeschlagen

# commonRetry
source: Retry
de: Erneut versuchen

# hometasksNone
source: No hometasks found.
de: Keine Hausaufgaben gefunden.

# hometasksUpdateOrderFailed
source: Failed to update order.
de: Reihenfolge konnte nicht aktualisiert werden.

# hometasksAssignTitle
source: Assign Hometask to {studentName}
de: Hausaufgabe an {studentName} zuweisen

# hometasksTitleLabel
source: Title
de: Titel

# hometasksTitleRequired
source: Title is required
de: Titel ist erforderlich

# hometasksDescriptionLabel
source: Description (optional)
de: Beschreibung (optional)

# hometasksDueDate
source: Due date
de: Faelligkeitsdatum

# hometasksNoDueDate
source: No due date
de: Kein Faelligkeitsdatum

# hometasksRepeatLabel
source: Repeat
de: Wiederholen

# hometasksRepeatNone
source: No repeat
de: Keine Wiederholung

# hometasksRepeatDaily
source: Each day
de: Taeglich

# hometasksRepeatWeekly
source: Each week
de: Woechentlich

# hometasksRepeatCustom
source: Custom interval
de: Benutzerdefiniertes Intervall

# hometasksRepeatEveryDays
source: Repeat every (days)
de: Alle (Tage) wiederholen

# hometasksRepeatCustomInvalid
source: Enter a positive number of days
de: Bitte positive Anzahl Tage eingeben

# hometasksTypeLabel
source: Hometask type
de: Aufgabentyp

# hometasksTypeSimple
source: Simple
de: Einfach

# hometasksTypeChecklist
source: Checklist
de: Checkliste

# hometasksTypeProgress
source: Progress
de: Fortschritt

# hometasksChecklistItems
source: Checklist items
de: Checklistenpunkte

# hometasksProgressItems
source: Progress items
de: Fortschrittspunkte

# hometasksItemLabel
source: Item {index}
de: Element {index}

# hometasksRequired
source: Required
de: Erforderlich

# hometasksAddAtLeastOne
source: Add at least one {typeLabel} item.
de: Mindestens ein {typeLabel}-Element hinzufuegen.

# hometasksRepeatIntervalInvalid
source: Enter a valid repeat interval.
de: Gueltiges Intervall eingeben.

# hometasksAssigned
source: Hometask assigned.
de: Hausaufgabe zugewiesen.

# hometasksAssignFailed
source: Failed to assign hometask.
de: Hausaufgabe konnte nicht zugewiesen werden.

# hometasksAssignAction
source: Assign
de: Zuweisen

# hometasksActive
source: Active
de: Aktiv

# hometasksArchive
source: Archive
de: Archiv

# hometasksAssign
source: Assign Hometask
de: Hausaufgabe zuweisen

# hometasksAssignToGroup
source: Assign to Group
de: An Gruppe zuweisen

# hometasksSelectGroupTitle
source: Select Group
de: Gruppe auswaehlen

# hometasksAssignTitleGroup
source: Assign Hometask to group {groupName}
de: Hausaufgabe an Gruppe {groupName} zuweisen

# hometasksApplyGroupChangesTitle
source: Apply group changes
de: Gruppenaenderungen anwenden

# hometasksApplyGroupChangesMessage
source: Apply these edits to all students in this group hometask?
de: Diese Aenderungen auf alle Schueler dieser Gruppen-Hausaufgabe anwenden?

# hometasksApplyOnlyThisStudent
source: Only this student
de: Nur dieser Schueler

# hometasksApplyToGroup
source: Apply to group
de: Auf Gruppe anwenden

# hometasksArchiveGroupTitle
source: Archive group hometask
de: Gruppen-Hausaufgabe archivieren

# hometasksArchiveGroupMessage
source: Archive only this student task, or all tasks in this group assignment?
de: Nur diese Schueleraufgabe archivieren oder alle Aufgaben in dieser Gruppenzuweisung?

# hometasksArchiveForGroup
source: Archive for group
de: Fuer Gruppe archivieren

# hometasksReopenGroupTitle
source: Reopen group hometask
de: Gruppen-Hausaufgabe wiedereroeffnen

# hometasksReopenGroupMessage
source: Reopen only this student task, or all tasks in this group assignment?
de: Nur diese Schueleraufgabe wiedereroeffnen oder alle Aufgaben in dieser Gruppenzuweisung?

# hometasksReopenForGroup
source: Reopen for group
de: Fuer Gruppe wiedereroeffnen

# feedsGroupFeeds
source: Group feeds
de: Gruppen-Feeds

# feedsOwnerGroup
source: Group
de: Gruppe

# profileCreateGroup
source: Create Group
de: Gruppe erstellen

# profileGroupsTitle
source: Groups
de: Gruppen

# profileNoGroupsYet
source: No groups yet
de: Noch keine Gruppen

# profileStudentsLabel
source: students
de: Schueler

# profileStatusArchived
source: Archived
de: Archiviert

# profileStatusActive
source: Active
de: Aktiv

# profileEditMembers
source: Edit members
de: Mitglieder bearbeiten

# profileArchiveGroup
source: Archive
de: Archivieren

# profileUnarchiveGroup
source: Unarchive
de: Wiederherstellen

# profileDeleteGroupTitle
source: Delete group
de: Gruppe loeschen

# profileDeleteGroupMessage
source: Delete this group permanently? Feed and group history will be removed.
de: Diese Gruppe dauerhaft loeschen? Feed- und Gruppenverlauf werden entfernt.

# profileAddStudentsFirstToCreateGroup
source: Add students first to create a group
de: Fuegen Sie zuerst Schueler hinzu, um eine Gruppe zu erstellen

# profileGroupNameLabel
source: Group name
de: Gruppenname

# profileFilterStudentsLabel
source: Filter students
de: Schueler filtern

# profileNoStudentsFound
source: No students found
de: Keine Schueler gefunden

# profileEnterGroupNameAndStudents
source: Enter group name and select students
de: Gruppennamen eingeben und Schueler auswaehlen

# profileCreateAction
source: Create
de: Erstellen

# profileEditGroupTitle
source: Edit Group
de: Gruppe bearbeiten

# profileArchivedGroupLabel
source: Archived group
de: Gruppe archiviert

# profileGroupCreatedSuccess
source: Group created successfully
de: Gruppe erfolgreich erstellt

# profileGroupUpdatedSuccess
source: Group updated successfully
de: Gruppe erfolgreich aktualisiert

# profileGroupDeletedSuccess
source: Group deleted successfully
de: Gruppe erfolgreich geloescht

# profileGroupCreateFailed
source: Failed to create group
de: Gruppe konnte nicht erstellt werden

# profileGroupUpdateFailed
source: Failed to update group
de: Gruppe konnte nicht aktualisiert werden

# profileGroupDeleteFailed
source: Failed to delete group
de: Gruppe konnte nicht geloescht werden
